tap "homebrew/services"
tap "mongodb/brew"
tap "nikitabobko/tap"
brew "bash"
brew "bat"
brew "libpng"
brew "cairo"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "giflib"
brew "git"
brew "go"
brew "jmeter"
brew "jpeg"
brew "pango"
brew "librsvg"
brew "make"
brew "maven"
brew "mysql", restart_service: :changed
brew "neovim"
brew "node@22"
brew "openjdk@11"
brew "openjdk@17"
brew "pkgconf"
brew "powerlevel10k"
brew "redis"
brew "ripgrep"
brew "stow"
brew "tailwindcss"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-database-tools"
brew "mongodb/brew/mongodb-community@5.0"
cask "aerospace"
cask "font-0xproto-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "warp"
cask "wezterm@nightly"
vscode "ahmadawais.shades-of-purple"
vscode "coderabbit.coderabbit-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eliverlara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "glenn2223.live-sass"
vscode "htmlhint.vscode-htmlhint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ritwickdey.liveserver"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
